Revit 2027 API
DuctSizeSettings.Item Property
 Get the DuctSizes for this DuctShape.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DuctSizes this[
	DuctShape ductShape
] { get; }
Public ReadOnly Default Property Item (
	ductShape As DuctShape
) As DuctSizes
	Get
public:
property DuctSizes^ default[DuctShape ductShape] {
	DuctSizes^ get (DuctShape ductShape);
}
member Item : DuctSizes with get
Parameters
ductShape DuctShape
 The duct shape.
Return Value
DuctSizes
 The DuctSizes for this DuctShape.
Exceptions
Exception | Condition
ArgumentException |  There is no DuctSizes for this DuctShape.
ArgumentNullException |  A non-optional argument was NULL
See Also
Reference
DuctSizeSettings Class
Autodesk.Revit.DB.Mechanical Namespace